tutorials/backStepLaminarBodyFitted/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 1 -0.1)
    (0 2 -0.1)
    (2 0 -0.1)
    (2 1 -0.1)
    (2 2 -0.1)
    (12 0 -0.1)
    (12 1 -0.1)
    (12 2 -0.1)
    (0 1 0.1)
    (0 2 0.1)
    (2 0 0.1)
    (2 1 0.1)
    (2 2 0.1)
    (12 0 0.1)
    (12 1 0.1)
    (12 2 0.1)
);

blocks
(
    hex (0 3 4 1 8 11 12 9) (20 20 1) simpleGrading (1 1 1)
    hex (2 5 6 3 10 13 14 11) (100 20 1) simpleGrading (1 1 1)
    hex (3 6 7 4 11 14 15 12) (100 20 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 8 9 1)
    )
    patch outlet
    (
        (5 6 14 13)
        (6 7 15 14)
    )
    wall upperWall
    (
        (1 9 12 4)
        (4 12 15 7)
    )
    wall lowerWall
    (
        (0 3 11 8)
        (3 2 10 11)
        (2 5 13 10)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
