tutorials/backStepLaminarBodyFitted/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          amgSolver;
        cycle           W-cycle;
        policy          AAMG;
        nPreSweeps      0;
        nPostSweeps     2;
        groupSize       2;
        minCoarseEqns   20;
        nMaxLevels      100;
        scale           on;
        smoother        ILU;

        tolerance        1e-8;
        relTol           0.01;
        minIter          1;
    }
//     p
//     {
//         solver           PCG;
//         preconditioner   DIC;
//         tolerance        1e-8;
//         relTol           0.01;
//         minIter          1;
//     }
    pStar
    {
        solver          amgSolver;
        cycle           W-cycle;
        policy          AAMG;
        nPreSweeps      0;
        nPostSweeps     2;
        groupSize       2;
        minCoarseEqns   20;
        nMaxLevels      100;
        scale           on;
        smoother        ILU;

        tolerance        1e-8;
        relTol           0.01;
        minIter          1;
    }
//     pStar
//     {
//         solver           PCG;
//         preconditioner   DIC;
//         tolerance        1e-8;
//         relTol           0.01;
//         minIter          1;
//     }
    U
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0.1;
        minIter          2;
    }
    UStar
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           0.1;
        minIter          2;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    convergence 1e-4;
}

relaxationFactors
{
    U               0.7;
    UStar           0.7;
    p               0.3; 
    pStar           0.3;
}

adjointSolutionControl
{
    primalIterations  200;
}


// ************************************************************************* //
