tutorials/backStepLaminarBodyFitted/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="simpleFoam"

runApplication blockMesh
runApplication $application
